# Напишите программу, которая подсчитывает количество четных и
# нечетных чисел в списке чисел. (Используйте встроенные функции,
# чтобы решить эту задачу)

nums = [1, 2, 3, 4, 5, 6, 7, 8, 9]

a = list(filter(lambda x: x % 2 == 0, nums))
print(len(a))


b = list(filter(lambda x: x % 2 != 0, nums))
print(len(b))


